NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Format value for bitfield I2C_C1_TX. */
#define BF_I2C_C1_TX(v)      ((uint8_t)((uint8_t)(v) << BP_I2C_C1_TX) & BM_I2C_C1_TX)

/*! @brief Set the TX field to a new value. */
#define BW_I2C_C1_TX(x, v)   (BME_BFI8(HW_I2C_C1_ADDR(x), ((uint8_t)(v) << BP_I2C_C1_TX), BP_I2C_C1_TX, 1))
/*@}*/

/*!
 * @name Register I2C_C1, field MST[5] (RW)
 *
 * When MST is changed from 0 to 1, a START signal is generated on the bus and
 * master mode is selected. When this bit changes from 1 to 0, a STOP signal is
 * generated and the mode of operation changes from master to slave.
 *
 * Values:
 * - 0 - Slave mode
 * - 1 - Master mode
 */
/*@{*/
#define BP_I2C_C1_MST        (5U)          /*!< Bit position for I2C_C1_MST. */
#define BM_I2C_C1_MST        (0x20U)       /*!< Bit mask for I2C_C1_MST. */
#define BS_I2C_C1_MST        (1U)          /*!< Bit field size in bits for I2C_C1_MST. */

/*! @brief Read current value of the I2C_C1_MST field. */
#define BR_I2C_C1_MST(x)     (BME_UBFX8(HW_I2C_C1_ADDR(x), BP_I2C_C1_MST, BS_I2C_C1_MST))

/*! @brief Format value for bitfield I2C_C1_MST. */
#define BF_I2C_C1_MST(v)     ((uint8_t)((uint8_t)(v) << BP_I2C_C1_MST) & BM_I2C_C1_MST)

/*! @brief Set the MST field to a new value. */
#define BW_I2C_C1_MST(x, v)  (BME_BFI8(HW_I2C_C1_ADDR(x), ((uint8_t)(v) << BP_I2C_C1_MST), BP_I2C_C1_MST, 1))
/*@}*/

/*!
 * @name Register I2C_C1, field IICIE[6] (RW)
 *
 * Enables I2C interrupt requests.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
#define BP_I2C_C1_IICIE      (6U)          /*!< Bit position for I2C_C1_IICIE. */
#define BM_I2C_C1_IICIE      (0x40U)       /*!< Bit mask for I2C_C1_IICIE. */
#define BS_I2C_C1_IICIE      (1U)          /*!< Bit field size in bits for I2C_C1_IICIE. */

/*! @brief Read current value of the I2C_C1_IICIE field. */
#define BR_I2C_C1_IICIE(x)   (BME_UBFX8(HW_I2C_C1_ADDR(x), BP_I2C_C1_IICIE, BS_I2C_C1_IICIE))

/*! @brief Format value for bitfield I2C_C1_IICIE. */
#define BF_I2C_C1_IICIE(v)   ((uint8_t)((uint8_t)(v) << BP_I2C_C1_IICIE) & BM_I2C_C1_IICIE)

/*! @brief Set the IICIE field to a new value. */
#define BW_I2C_C1_IICIE(x, v) (BME_BFI8(HW_I2C_C1_ADDR(x), ((uint8_t)(v) << BP_I2C_C1_IICIE), BP_I2C_C1_IICIE, 1))
/*@}*/

/*!
 * @name Register I2C_C1, field IICEN[7] (RW)
 *
 * Enables I2C module operation.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
#define BP_I2C_C1_IICEN      (7U)          /*!< Bit position for I2C_C1_IICEN. */
#define BM_I2C_C1_IICEN      (0x80U)       /*!< Bit mask for I2C_C1_IICEN. */
#define BS_I2C_C1_IICEN      (1U)          /*!< Bit field size in bits for I2C_C1_IICEN. */

/*! @brief Read current value of the I2C_C1_IICEN field. */
#define BR_I2C_C1_IICEN(x)   (BME_UBFX8(HW_I2C_C1_ADDR(x), BP_I2C_C1_IICEN, BS_I2C_C1_IICEN))

/*! @brief Format value for bitfield I2C_C1_IICEN. */
#define BF_I2C_C1_IICEN(v)   ((uint8_t)((uint8_t)(v) << BP_I2C_C1_IICEN) & BM_I2C_C1_IICEN)

/*! @brief Set the IICEN field to a new value. */
#define BW_I2C_C1_IICEN(x, v) (BME_BFI8(HW_I2C_C1_ADDR(x), ((uint8_t)(v) << BP_I2C_C1_IICEN), BP_I2C_C1_IICEN, 1))
/*@}*/

/*******************************************************************************
 * HW_I2C_S1 - I2C Status register 1
 ******************************************************************************/

/*!
 * @brief HW_I2C_S1 - I2C Status register 1 (RW)
 *
 * Reset value: 0x80U
 */
typedef union _hw_i2c_s1
{
    uint8_t U;
    struct _hw_i2c_s1_bitfields
    {
        uint8_t RXAK : 1;              /*!< [0] Receive Acknowledge */
        uint8_t IICIF : 1;             /*!< [1] Interrupt Flag */
        uint8_t SRW : 1;               /*!< [2] Slave Read/Write */
        uint8_t RAM : 1;               /*!< [3] Range Address Match */
        uint8_t ARBL : 1;              /*!< [4] Arbitration Lost */
        uint8_t BUSY : 1;              /*!< [5] Bus Busy */
        uint8_t IAAS : 1;              /*!< [6] Addressed As A Slave */
        uint8_t TCF : 1;               /*!< [7] Transfer Complete Flag */
    } B;
} hw_i2c_s1_t;

/*!
 * @name Constants and macros for entire I2C_S1 register
 */
/*@{*/
#define HW_I2C_S1_ADDR(x)        ((uint32_t)(x) + 0x3U)

#define HW_I2C_S1(x)             (*(__IO hw_i2c_s1_t *) HW_I2C_S1_ADDR(x))
#define HW_I2C_S1_RD(x)          (HW_I2C_S1(x).U)
#define HW_I2C_S1_WR(x, v)       (HW_I2C_S1(x).U = (v))
#define HW_I2C_S1_SET(x, v)      (BME_OR8(HW_I2C_S1_ADDR(x), (uint8_t)(v)))
#define HW_I2C_S1_CLR(x, v)      (BME_AND8(HW_I2C_S1_ADDR(x), (uint8_t)(~(v))))
#define HW_I2C_S1_TOG(x, v)      (BME_XOR8(HW_I2C_S1_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual I2C_S1 bitfields
 */

/*!
 * @name Register I2C_S1, field RXAK[0] (RO)
 *
 * Values:
 * - 0 - Acknowledge signal was received after the completion of one byte of
 *     data transmission on the bus
 * - 1 - No acknowledge signal detected
 */
/*@{*/
#define BP_I2C_S1_RXAK       (0U)          /*!< Bit position for I2C_S1_RXAK. */
#define BM_I2C_S1_RXAK       (0x01U)       /*!< Bit mask for I2C_S1_RXAK. */
#define BS_I2C_S1_RXAK       (1U)          /*!< Bit field size in bits for I2C_S1_RXAK. */

/*! @brief Read current value of the I2C_S1_RXAK field. */
#define BR_I2C_S1_RXAK(x)    (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_RXAK, BS_I2C_S1_RXAK))
/*@}*/

/*!
 * @name Register I2C_S1, field IICIF[1] (W1C)
 *
 * This bit sets when an interrupt is pending. This bit must be cleared by
 * software by writing 1 to it, such as in the interrupt routine. One of the following
 * events can set this bit: One byte transfer, including ACK/NACK bit, completes
 * if FACK is 0. An ACK or NACK is sent on the bus by writing 0 or 1 to TXAK
 * after this bit is set in receive mode. One byte transfer, excluding ACK/NACK bit,
 * completes if FACK is 1. Match of slave address to calling address including
 * primary slave address, range slave address , alert response address, second
 * slave address, or general call address. Arbitration lost In SMBus mode, any
 * timeouts except SCL and SDA high timeouts I2C bus stop detection if the STOPIE bit
 * in the Input Glitch Filter register is 1 To clear the I2C bus stop detection
 * interrupt: In the interrupt service routine, first clear the STOPF bit in the
 * Input Glitch Filter register by writing 1 to it, and then clear the IICIF bit.
 * If this sequence is reversed, the IICIF bit is asserted again.
 *
 * Values:
 * - 0 - No interrupt pending
 * - 1 - Interrupt pending
 */
/*@{*/
#define BP_I2C_S1_IICIF      (1U)          /*!< Bit position for I2C_S1_IICIF. */
#define BM_I2C_S1_IICIF      (0x02U)       /*!< Bit mask for I2C_S1_IICIF. */
#define BS_I2C_S1_IICIF      (1U)          /*!< Bit field size in bits for I2C_S1_IICIF. */

/*! @brief Read current value of the I2C_S1_IICIF field. */
#define BR_I2C_S1_IICIF(x)   (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_IICIF, BS_I2C_S1_IICIF))

/*! @brief Format value for bitfield I2C_S1_IICIF. */
#define BF_I2C_S1_IICIF(v)   ((uint8_t)((uint8_t)(v) << BP_I2C_S1_IICIF) & BM_I2C_S1_IICIF)

/*! @brief Set the IICIF field to a new value. */
#define BW_I2C_S1_IICIF(x, v) (BME_BFI8(HW_I2C_S1_ADDR(x), ((uint8_t)(v) << BP_I2C_S1_IICIF), BP_I2C_S1_IICIF, 1))
/*@}*/

/*!
 * @name Register I2C_S1, field SRW[2] (RO)
 *
 * When addressed as a slave, SRW indicates the value of the R/W command bit of
 * the calling address sent to the master.
 *
 * Values:
 * - 0 - Slave receive, master writing to slave
 * - 1 - Slave transmit, master reading from slave
 */
/*@{*/
#define BP_I2C_S1_SRW        (2U)          /*!< Bit position for I2C_S1_SRW. */
#define BM_I2C_S1_SRW        (0x04U)       /*!< Bit mask for I2C_S1_SRW. */
#define BS_I2C_S1_SRW        (1U)          /*!< Bit field size in bits for I2C_S1_SRW. */

