NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Read current value of the I2C_S1_SRW field. */
#define BR_I2C_S1_SRW(x)     (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_SRW, BS_I2C_S1_SRW))
/*@}*/

/*!
 * @name Register I2C_S1, field RAM[3] (RW)
 *
 * This bit is set to 1 by any of the following conditions: Any nonzero calling
 * address is received that matches the address in the RA register. The RMEN bit
 * is set and the calling address is within the range of values of the A1 and RA
 * registers. For the RAM bit to be set to 1 correctly, C1[IICIE] must be set to
 * 1. Writing the C1 register with any value clears this bit to 0.
 *
 * Values:
 * - 0 - Not addressed
 * - 1 - Addressed as a slave
 */
/*@{*/
#define BP_I2C_S1_RAM        (3U)          /*!< Bit position for I2C_S1_RAM. */
#define BM_I2C_S1_RAM        (0x08U)       /*!< Bit mask for I2C_S1_RAM. */
#define BS_I2C_S1_RAM        (1U)          /*!< Bit field size in bits for I2C_S1_RAM. */

/*! @brief Read current value of the I2C_S1_RAM field. */
#define BR_I2C_S1_RAM(x)     (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_RAM, BS_I2C_S1_RAM))

/*! @brief Format value for bitfield I2C_S1_RAM. */
#define BF_I2C_S1_RAM(v)     ((uint8_t)((uint8_t)(v) << BP_I2C_S1_RAM) & BM_I2C_S1_RAM)

/*! @brief Set the RAM field to a new value. */
#define BW_I2C_S1_RAM(x, v)  (BME_BFI8(HW_I2C_S1_ADDR(x), ((uint8_t)(v) << BP_I2C_S1_RAM), BP_I2C_S1_RAM, 1))
/*@}*/

/*!
 * @name Register I2C_S1, field ARBL[4] (W1C)
 *
 * This bit is set by hardware when the arbitration procedure is lost. The ARBL
 * bit must be cleared by software, by writing 1 to it.
 *
 * Values:
 * - 0 - Standard bus operation.
 * - 1 - Loss of arbitration.
 */
/*@{*/
#define BP_I2C_S1_ARBL       (4U)          /*!< Bit position for I2C_S1_ARBL. */
#define BM_I2C_S1_ARBL       (0x10U)       /*!< Bit mask for I2C_S1_ARBL. */
#define BS_I2C_S1_ARBL       (1U)          /*!< Bit field size in bits for I2C_S1_ARBL. */

/*! @brief Read current value of the I2C_S1_ARBL field. */
#define BR_I2C_S1_ARBL(x)    (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_ARBL, BS_I2C_S1_ARBL))

/*! @brief Format value for bitfield I2C_S1_ARBL. */
#define BF_I2C_S1_ARBL(v)    ((uint8_t)((uint8_t)(v) << BP_I2C_S1_ARBL) & BM_I2C_S1_ARBL)

/*! @brief Set the ARBL field to a new value. */
#define BW_I2C_S1_ARBL(x, v) (BME_BFI8(HW_I2C_S1_ADDR(x), ((uint8_t)(v) << BP_I2C_S1_ARBL), BP_I2C_S1_ARBL, 1))
/*@}*/

/*!
 * @name Register I2C_S1, field BUSY[5] (RO)
 *
 * Indicates the status of the bus regardless of slave or master mode. This bit
 * is set when a START signal is detected and cleared when a STOP signal is
 * detected.
 *
 * Values:
 * - 0 - Bus is idle
 * - 1 - Bus is busy
 */
/*@{*/
#define BP_I2C_S1_BUSY       (5U)          /*!< Bit position for I2C_S1_BUSY. */
#define BM_I2C_S1_BUSY       (0x20U)       /*!< Bit mask for I2C_S1_BUSY. */
#define BS_I2C_S1_BUSY       (1U)          /*!< Bit field size in bits for I2C_S1_BUSY. */

/*! @brief Read current value of the I2C_S1_BUSY field. */
#define BR_I2C_S1_BUSY(x)    (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_BUSY, BS_I2C_S1_BUSY))
/*@}*/

/*!
 * @name Register I2C_S1, field IAAS[6] (RW)
 *
 * This bit is set by one of the following conditions: The calling address
 * matches the programmed slave primary address in the A1 register or range address in
 * the RA register (which must be set to a nonzero value). C2[GCAEN] is set and
 * a general call is received. SMB[SIICAEN] is set and the calling address
 * matches the second programmed slave address. ALERTEN is set and an SMBus alert
 * response address is received RMEN is set and an address is received that is within
 * the range between the values of the A1 and RA registers. IAAS sets before the
 * ACK bit. The CPU must check the SRW bit and set TX/RX accordingly. Writing the
 * C1 register with any value clears this bit.
 *
 * Values:
 * - 0 - Not addressed
 * - 1 - Addressed as a slave
 */
/*@{*/
#define BP_I2C_S1_IAAS       (6U)          /*!< Bit position for I2C_S1_IAAS. */
#define BM_I2C_S1_IAAS       (0x40U)       /*!< Bit mask for I2C_S1_IAAS. */
#define BS_I2C_S1_IAAS       (1U)          /*!< Bit field size in bits for I2C_S1_IAAS. */

/*! @brief Read current value of the I2C_S1_IAAS field. */
#define BR_I2C_S1_IAAS(x)    (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_IAAS, BS_I2C_S1_IAAS))

/*! @brief Format value for bitfield I2C_S1_IAAS. */
#define BF_I2C_S1_IAAS(v)    ((uint8_t)((uint8_t)(v) << BP_I2C_S1_IAAS) & BM_I2C_S1_IAAS)

/*! @brief Set the IAAS field to a new value. */
#define BW_I2C_S1_IAAS(x, v) (BME_BFI8(HW_I2C_S1_ADDR(x), ((uint8_t)(v) << BP_I2C_S1_IAAS), BP_I2C_S1_IAAS, 1))
/*@}*/

/*!
 * @name Register I2C_S1, field TCF[7] (RO)
 *
 * Acknowledges a byte transfer; TCF sets on the completion of a byte transfer.
 * This bit is valid only during or immediately following a transfer to or from
 * the I2C module. TCF is cleared by reading the I2C data register in receive mode
 * or by writing to the I2C data register in transmit mode.
 *
 * Values:
 * - 0 - Transfer in progress
 * - 1 - Transfer complete
 */
/*@{*/
#define BP_I2C_S1_TCF        (7U)          /*!< Bit position for I2C_S1_TCF. */
#define BM_I2C_S1_TCF        (0x80U)       /*!< Bit mask for I2C_S1_TCF. */
#define BS_I2C_S1_TCF        (1U)          /*!< Bit field size in bits for I2C_S1_TCF. */

/*! @brief Read current value of the I2C_S1_TCF field. */
#define BR_I2C_S1_TCF(x)     (BME_UBFX8(HW_I2C_S1_ADDR(x), BP_I2C_S1_TCF, BS_I2C_S1_TCF))
/*@}*/

/*******************************************************************************
 * HW_I2C_D - I2C Data I/O register
 ******************************************************************************/

/*!
 * @brief HW_I2C_D - I2C Data I/O register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_i2c_d
{
    uint8_t U;
    struct _hw_i2c_d_bitfields
    {
        uint8_t DATA : 8;              /*!< [7:0] Data */
    } B;
} hw_i2c_d_t;

/*!
 * @name Constants and macros for entire I2C_D register
 */
/*@{*/
#define HW_I2C_D_ADDR(x)         ((uint32_t)(x) + 0x4U)

