NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*
 * Constants & macros for individual I2C_SLTH bitfields
 */

/*!
 * @name Register I2C_SLTH, field SSLT[7:0] (RW)
 *
 * Most significant byte of SCL low timeout value that determines the timeout
 * period of SCL low.
 */
/*@{*/
#define BP_I2C_SLTH_SSLT     (0U)          /*!< Bit position for I2C_SLTH_SSLT. */
#define BM_I2C_SLTH_SSLT     (0xFFU)       /*!< Bit mask for I2C_SLTH_SSLT. */
#define BS_I2C_SLTH_SSLT     (8U)          /*!< Bit field size in bits for I2C_SLTH_SSLT. */

/*! @brief Read current value of the I2C_SLTH_SSLT field. */
#define BR_I2C_SLTH_SSLT(x)  (HW_I2C_SLTH(x).U)

/*! @brief Format value for bitfield I2C_SLTH_SSLT. */
#define BF_I2C_SLTH_SSLT(v)  ((uint8_t)((uint8_t)(v) << BP_I2C_SLTH_SSLT) & BM_I2C_SLTH_SSLT)

/*! @brief Set the SSLT field to a new value. */
#define BW_I2C_SLTH_SSLT(x, v) (HW_I2C_SLTH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_I2C_SLTL - I2C SCL Low Timeout Register Low
 ******************************************************************************/

/*!
 * @brief HW_I2C_SLTL - I2C SCL Low Timeout Register Low (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_i2c_sltl
{
    uint8_t U;
    struct _hw_i2c_sltl_bitfields
    {
        uint8_t SSLT : 8;              /*!< [7:0]  */
    } B;
} hw_i2c_sltl_t;

/*!
 * @name Constants and macros for entire I2C_SLTL register
 */
/*@{*/
#define HW_I2C_SLTL_ADDR(x)      ((uint32_t)(x) + 0xBU)

#define HW_I2C_SLTL(x)           (*(__IO hw_i2c_sltl_t *) HW_I2C_SLTL_ADDR(x))
#define HW_I2C_SLTL_RD(x)        (HW_I2C_SLTL(x).U)
#define HW_I2C_SLTL_WR(x, v)     (HW_I2C_SLTL(x).U = (v))
#define HW_I2C_SLTL_SET(x, v)    (BME_OR8(HW_I2C_SLTL_ADDR(x), (uint8_t)(v)))
#define HW_I2C_SLTL_CLR(x, v)    (BME_AND8(HW_I2C_SLTL_ADDR(x), (uint8_t)(~(v))))
#define HW_I2C_SLTL_TOG(x, v)    (BME_XOR8(HW_I2C_SLTL_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual I2C_SLTL bitfields
 */

/*!
 * @name Register I2C_SLTL, field SSLT[7:0] (RW)
 *
 * Least significant byte of SCL low timeout value that determines the timeout
 * period of SCL low.
 */
/*@{*/
#define BP_I2C_SLTL_SSLT     (0U)          /*!< Bit position for I2C_SLTL_SSLT. */
#define BM_I2C_SLTL_SSLT     (0xFFU)       /*!< Bit mask for I2C_SLTL_SSLT. */
#define BS_I2C_SLTL_SSLT     (8U)          /*!< Bit field size in bits for I2C_SLTL_SSLT. */

/*! @brief Read current value of the I2C_SLTL_SSLT field. */
#define BR_I2C_SLTL_SSLT(x)  (HW_I2C_SLTL(x).U)

/*! @brief Format value for bitfield I2C_SLTL_SSLT. */
#define BF_I2C_SLTL_SSLT(v)  ((uint8_t)((uint8_t)(v) << BP_I2C_SLTL_SSLT) & BM_I2C_SLTL_SSLT)

/*! @brief Set the SSLT field to a new value. */
#define BW_I2C_SLTL_SSLT(x, v) (HW_I2C_SLTL_WR(x, v))
/*@}*/

/*******************************************************************************
 * hw_i2c_t - module struct
 ******************************************************************************/
/*!
 * @brief All I2C module registers.
 */
#pragma pack(1)
typedef struct _hw_i2c
{
    __IO hw_i2c_a1_t A1;                   /*!< [0x0] I2C Address Register 1 */
    __IO hw_i2c_f_t F;                     /*!< [0x1] I2C Frequency Divider register */
    __IO hw_i2c_c1_t C1;                   /*!< [0x2] I2C Control Register 1 */
    __IO hw_i2c_s1_t S1;                   /*!< [0x3] I2C Status register 1 */
    __IO hw_i2c_d_t D;                     /*!< [0x4] I2C Data I/O register */
    __IO hw_i2c_c2_t C2;                   /*!< [0x5] I2C Control Register 2 */
    __IO hw_i2c_flt_t FLT;                 /*!< [0x6] I2C Programmable Input Glitch Filter register */
    __IO hw_i2c_ra_t RA;                   /*!< [0x7] I2C Range Address register */
    __IO hw_i2c_smb_t SMB;                 /*!< [0x8] I2C SMBus Control and Status register */
    __IO hw_i2c_a2_t A2;                   /*!< [0x9] I2C Address Register 2 */
    __IO hw_i2c_slth_t SLTH;               /*!< [0xA] I2C SCL Low Timeout Register High */
    __IO hw_i2c_sltl_t SLTL;               /*!< [0xB] I2C SCL Low Timeout Register Low */
} hw_i2c_t;
#pragma pack()

/*! @brief Macro to access all I2C registers. */
/*! @param x I2C module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_I2C_REGS(I2C0_BASE)</code>. */
#define HW_I2C_REGS(x) (*(hw_i2c_t *)(x))

/* Backward compatibility */
#define HW_I2C_S(x)             HW_I2C_S1(x)
#define HW_I2C_S_RD(x)          HW_I2C_S1_RD(x)
#define HW_I2C_S_WR(x, v)       HW_I2C_S1_WR(x, v)
#define HW_I2C_S_SET(x, v)      HW_I2C_S1_SET(x, v)
#define HW_I2C_S_CLR(x, v)      HW_I2C_S1_CLR(x, v)
#define HW_I2C_S_TOG(x, v)      HW_I2C_S1_TOG(x, v)
#define BP_I2C_S_RXAK           BP_I2C_S1_RXAK
#define BM_I2C_S_RXAK           BM_I2C_S1_RXAK
#define BS_I2C_S_RXAK           BS_I2C_S1_RXAK
#define BR_I2C_S_RXAK(x)        BR_I2C_S1_RXAK(x)
#define BP_I2C_S_IICIF          BP_I2C_S1_IICIF
#define BM_I2C_S_IICIF          BM_I2C_S1_IICIF
#define BS_I2C_S_IICIF          BS_I2C_S1_IICIF
#define BR_I2C_S_IICIF(x)       BR_I2C_S1_IICIF(x)
#define BF_I2C_S_IICIF(v)       BF_I2C_S1_IICIF(v)
#define BW_I2C_S_IICIF(x, v)    BW_I2C_S1_IICIF(x, v)
#define BP_I2C_S_SRW            BP_I2C_S1_SRW
#define BM_I2C_S_SRW            BM_I2C_S1_SRW
#define BS_I2C_S_SRW            BS_I2C_S1_SRW
#define BR_I2C_S_SRW(x)         BR_I2C_S1_SRW(x)
#define BP_I2C_S_RAM            BP_I2C_S1_RAM
#define BM_I2C_S_RAM            BM_I2C_S1_RAM
#define BS_I2C_S_RAM            BS_I2C_S1_RAM
#define BR_I2C_S_RAM(x)         BR_I2C_S1_RAM(x)
#define BF_I2C_S_RAM(v)         BF_I2C_S1_RAM(v)
#define BW_I2C_S_RAM(x, v)      BW_I2C_S1_RAM(x, v)
#define BP_I2C_S_ARBL           BP_I2C_S1_ARBL
#define BM_I2C_S_ARBL           BM_I2C_S1_ARBL
#define BS_I2C_S_ARBL           BS_I2C_S1_ARBL
#define BR_I2C_S_ARBL(x)        BR_I2C_S1_ARBL(x)
#define BF_I2C_S_ARBL(v)        BF_I2C_S1_ARBL(v)
#define BW_I2C_S_ARBL(x, v)     BW_I2C_S1_ARBL(x, v)
#define BP_I2C_S_BUSY           BP_I2C_S1_BUSY
#define BM_I2C_S_BUSY           BM_I2C_S1_BUSY
#define BS_I2C_S_BUSY           BS_I2C_S1_BUSY
#define BR_I2C_S_BUSY(x)        BR_I2C_S1_BUSY(x)
#define BP_I2C_S_IAAS           BP_I2C_S1_IAAS
#define BM_I2C_S_IAAS           BM_I2C_S1_IAAS
#define BS_I2C_S_IAAS           BS_I2C_S1_IAAS
#define BR_I2C_S_IAAS(x)        BR_I2C_S1_IAAS(x)
#define BF_I2C_S_IAAS(v)        BF_I2C_S1_IAAS(v)
#define BW_I2C_S_IAAS(x, v)     BW_I2C_S1_IAAS(x, v)
#define BP_I2C_S_TCF            BP_I2C_S1_TCF
#define BM_I2C_S_TCF            BM_I2C_S1_TCF
#define BS_I2C_S_TCF            BS_I2C_S1_TCF
#define BR_I2C_S_TCF(x)         BR_I2C_S1_TCF(x)

