NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Format value for bitfield SMC_STOPCTRL_PSTOPO. */
#define BF_SMC_STOPCTRL_PSTOPO(v) ((uint8_t)((uint8_t)(v) << BP_SMC_STOPCTRL_PSTOPO) & BM_SMC_STOPCTRL_PSTOPO)

/*! @brief Set the PSTOPO field to a new value. */
#define BW_SMC_STOPCTRL_PSTOPO(x, v) (BME_BFI8(HW_SMC_STOPCTRL_ADDR(x), ((uint8_t)(v) << BP_SMC_STOPCTRL_PSTOPO), BP_SMC_STOPCTRL_PSTOPO, 2))
/*@}*/

/*******************************************************************************
 * HW_SMC_PMSTAT - Power Mode Status register
 ******************************************************************************/

/*!
 * @brief HW_SMC_PMSTAT - Power Mode Status register (RO)
 *
 * Reset value: 0x01U
 *
 * PMSTAT is a read-only, one-hot register which indicates the current power
 * mode of the system. This register is reset on Chip POR not VLLS and by reset
 * types that trigger Chip POR not VLLS. It is unaffected by reset types that do not
 * trigger Chip POR not VLLS. See the Reset section details for more information.
 */
typedef union _hw_smc_pmstat
{
    uint8_t U;
    struct _hw_smc_pmstat_bitfields
    {
        uint8_t PMSTAT : 7;            /*!< [6:0]  */
        uint8_t RESERVED0 : 1;         /*!< [7]  */
    } B;
} hw_smc_pmstat_t;

/*!
 * @name Constants and macros for entire SMC_PMSTAT register
 */
/*@{*/
#define HW_SMC_PMSTAT_ADDR(x)    ((uint32_t)(x) + 0x3U)

#define HW_SMC_PMSTAT(x)         (*(__I hw_smc_pmstat_t *) HW_SMC_PMSTAT_ADDR(x))
#define HW_SMC_PMSTAT_RD(x)      (HW_SMC_PMSTAT(x).U)
/*@}*/

/*
 * Constants & macros for individual SMC_PMSTAT bitfields
 */

/*!
 * @name Register SMC_PMSTAT, field PMSTAT[6:0] (RO)
 *
 * When debug is enabled, the PMSTAT will not update to STOP or VLPS When a
 * PSTOP mode is enabled, the PMSTAT will not update to STOP or VLPS
 */
/*@{*/
#define BP_SMC_PMSTAT_PMSTAT (0U)          /*!< Bit position for SMC_PMSTAT_PMSTAT. */
#define BM_SMC_PMSTAT_PMSTAT (0x7FU)       /*!< Bit mask for SMC_PMSTAT_PMSTAT. */
#define BS_SMC_PMSTAT_PMSTAT (7U)          /*!< Bit field size in bits for SMC_PMSTAT_PMSTAT. */

/*! @brief Read current value of the SMC_PMSTAT_PMSTAT field. */
#define BR_SMC_PMSTAT_PMSTAT(x) (BME_UBFX8(HW_SMC_PMSTAT_ADDR(x), BP_SMC_PMSTAT_PMSTAT, BS_SMC_PMSTAT_PMSTAT))
/*@}*/

/*******************************************************************************
 * hw_smc_t - module struct
 ******************************************************************************/
/*!
 * @brief All SMC module registers.
 */
#pragma pack(1)
typedef struct _hw_smc
{
    __IO hw_smc_pmprot_t PMPROT;           /*!< [0x0] Power Mode Protection register */
    __IO hw_smc_pmctrl_t PMCTRL;           /*!< [0x1] Power Mode Control register */
    __IO hw_smc_stopctrl_t STOPCTRL;       /*!< [0x2] Stop Control Register */
    __I hw_smc_pmstat_t PMSTAT;            /*!< [0x3] Power Mode Status register */
} hw_smc_t;
#pragma pack()

/*! @brief Macro to access all SMC registers. */
/*! @param x SMC module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_SMC_REGS(SMC_BASE)</code>. */
#define HW_SMC_REGS(x) (*(hw_smc_t *)(x))

/*
 * MKL26Z4 SPI
 *
 * Serial Peripheral Interface
 *
 * Registers defined in this header file:
 * - HW_SPI_S - SPI Status Register
 * - HW_SPI_BR - SPI Baud Rate Register
 * - HW_SPI_C2 - SPI Control Register 2
 * - HW_SPI_C1 - SPI Control Register 1
 * - HW_SPI_ML - SPI Match Register low
 * - HW_SPI_MH - SPI match register high
 * - HW_SPI_DL - SPI Data Register low
 * - HW_SPI_DH - SPI data register high
 * - HW_SPI_CI - SPI clear interrupt register
 * - HW_SPI_C3 - SPI control register 3
 *
 * - hw_spi_t - Struct containing all module registers.
 */

#define HW_SPI_INSTANCE_COUNT (2U) /*!< Number of instances of the SPI module. */
#define HW_SPI0 (0U) /*!< Instance number for SPI0. */
#define HW_SPI1 (1U) /*!< Instance number for SPI1. */

/*******************************************************************************
 * HW_SPI_S - SPI Status Register
 ******************************************************************************/

/*!
 * @brief HW_SPI_S - SPI Status Register (RO)
 *
 * Reset value: 0x20U
 *
 * This register contains read-only status bits. Writes have no meaning or
 * effect. When the FIFO is supported and enabled (FIFOMODE is 1): This register has
 * four flags that provide mechanisms to support an 8-byte FIFO mode: RNFULLF,
 * TNEARF, TXFULLF, and RFIFOEF. When the SPI is in 8-byte FIFO mode, the function
 * of SPRF and SPTEF differs slightly from their function in the normal buffered
 * modes, mainly regarding how these flags are cleared by the amount available in
 * the transmit and receive FIFOs. The RNFULLF and TNEAREF help improve the
 * efficiency of FIFO operation when transfering large amounts of data. These flags
 * provide a "watermark" feature of the FIFOs to allow continuous transmissions of
 * data when running at high speed. The RNFULLF can generate an interrupt if the
 * RNFULLIEN bit in the C3 register is set, which allows the CPU to start
 * emptying the receive FIFO without delaying the reception of subsequent bytes. The
 * user can also determine if all data in the receive FIFO has been read by
 * monitoring the RFIFOEF. The TNEAREF can generate an interrupt if the TNEARIEN bit in
 * the C3 register is set, which allows the CPU to start filling the transmit FIFO
 * before it is empty and thus to prevent breaks in SPI transmission. At an
 * initial POR, the values of TNEAREF and RFIFOEF are 0. However, the status (S)
 * register and both TX and RX FIFOs are reset due to a change of SPIMODE, FIFOMODE
 * or SPE. If this type of reset occurs and FIFOMODE is 0, TNEAREF and RFIFOEF
 * continue to reset to 0. If this type of reset occurs and FIFOMODE is 1, TNEAREF
 * and RFIFOEF reset to 1.
 */
typedef union _hw_spi_s
{
    uint8_t U;
    struct _hw_spi_s_bitfields
    {
        uint8_t RFIFOEF : 1;           /*!< [0] SPI read FIFO empty flag */
        uint8_t TXFULLF : 1;           /*!< [1] Transmit FIFO full flag */
        uint8_t TNEAREF : 1;           /*!< [2] Transmit FIFO nearly empty flag */
        uint8_t RNFULLF : 1;           /*!< [3] Receive FIFO nearly full flag */
        uint8_t MODF : 1;              /*!< [4] Master Mode Fault Flag */
        uint8_t SPTEF : 1;             /*!< [5] SPI Transmit Buffer Empty Flag (when FIFO
                                        * is not supported or not enabled) or SPI transmit FIFO empty flag (when
                                        * FIFO is supported and enabled) */
        uint8_t SPMF : 1;              /*!< [6] SPI Match Flag */
        uint8_t SPRF : 1;              /*!< [7] SPI Read Buffer Full Flag (when FIFO is
                                        * not supported or not enabled) or SPI read FIFO FULL flag (when FIFO is
                                        * supported and enabled) */
    } B;
} hw_spi_s_t;

/*!
 * @name Constants and macros for entire SPI_S register
 */
/*@{*/
#define HW_SPI_S_ADDR(x)         ((uint32_t)(x) + 0x0U)

#define HW_SPI_S(x)              (*(__I hw_spi_s_t *) HW_SPI_S_ADDR(x))
#define HW_SPI_S_RD(x)           (HW_SPI_S(x).U)
/*@}*/

