NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Read current value of the TSI_GENCS_CURSW field. */
#define BR_TSI_GENCS_CURSW(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_CURSW, BS_TSI_GENCS_CURSW))

/*! @brief Format value for bitfield TSI_GENCS_CURSW. */
#define BF_TSI_GENCS_CURSW(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_CURSW) & BM_TSI_GENCS_CURSW)

/*! @brief Set the CURSW field to a new value. */
#define BW_TSI_GENCS_CURSW(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_CURSW), BP_TSI_GENCS_CURSW, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EOSF[2] (W1C)
 *
 * This flag is set when all active electrodes are finished scanning after a
 * scan trigger. Write "1" , when this flag is set, to clear it.
 *
 * Values:
 * - 0 - Scan not complete.
 * - 1 - Scan complete.
 */
/*@{*/
#define BP_TSI_GENCS_EOSF    (2U)          /*!< Bit position for TSI_GENCS_EOSF. */
#define BM_TSI_GENCS_EOSF    (0x00000004U) /*!< Bit mask for TSI_GENCS_EOSF. */
#define BS_TSI_GENCS_EOSF    (1U)          /*!< Bit field size in bits for TSI_GENCS_EOSF. */

/*! @brief Read current value of the TSI_GENCS_EOSF field. */
#define BR_TSI_GENCS_EOSF(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EOSF, BS_TSI_GENCS_EOSF))

/*! @brief Format value for bitfield TSI_GENCS_EOSF. */
#define BF_TSI_GENCS_EOSF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_EOSF) & BM_TSI_GENCS_EOSF)

/*! @brief Set the EOSF field to a new value. */
#define BW_TSI_GENCS_EOSF(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_EOSF), BP_TSI_GENCS_EOSF, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SCNIP[3] (RO)
 *
 * This read-only bit indicates if scan is in progress. This bit will get
 * asserted after the analog bias circuit is stable after a trigger and it changes
 * automatically by the TSI.
 *
 * Values:
 * - 0 - No scan in progress.
 * - 1 - Scan in progress.
 */
/*@{*/
#define BP_TSI_GENCS_SCNIP   (3U)          /*!< Bit position for TSI_GENCS_SCNIP. */
#define BM_TSI_GENCS_SCNIP   (0x00000008U) /*!< Bit mask for TSI_GENCS_SCNIP. */
#define BS_TSI_GENCS_SCNIP   (1U)          /*!< Bit field size in bits for TSI_GENCS_SCNIP. */

/*! @brief Read current value of the TSI_GENCS_SCNIP field. */
#define BR_TSI_GENCS_SCNIP(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_SCNIP, BS_TSI_GENCS_SCNIP))
/*@}*/

/*!
 * @name Register TSI_GENCS, field STM[4] (RW)
 *
 * This bit specifies the trigger mode. User is allowed to change this bit when
 * TSI is not working in progress.
 *
 * Values:
 * - 0 - Software trigger scan.
 * - 1 - Hardware trigger scan.
 */
/*@{*/
#define BP_TSI_GENCS_STM     (4U)          /*!< Bit position for TSI_GENCS_STM. */
#define BM_TSI_GENCS_STM     (0x00000010U) /*!< Bit mask for TSI_GENCS_STM. */
#define BS_TSI_GENCS_STM     (1U)          /*!< Bit field size in bits for TSI_GENCS_STM. */

/*! @brief Read current value of the TSI_GENCS_STM field. */
#define BR_TSI_GENCS_STM(x)  (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_STM, BS_TSI_GENCS_STM))

/*! @brief Format value for bitfield TSI_GENCS_STM. */
#define BF_TSI_GENCS_STM(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_STM) & BM_TSI_GENCS_STM)

/*! @brief Set the STM field to a new value. */
#define BW_TSI_GENCS_STM(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_STM), BP_TSI_GENCS_STM, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field STPE[5] (RW)
 *
 * This bit enables TSI module function in low power modes (stop, VLPS, LLS and
 * VLLS{3,2,1}).
 *
 * Values:
 * - 0 - TSI is disabled when MCU goes into low power mode.
 * - 1 - Allows TSI to continue running in all low power modes.
 */
/*@{*/
#define BP_TSI_GENCS_STPE    (5U)          /*!< Bit position for TSI_GENCS_STPE. */
#define BM_TSI_GENCS_STPE    (0x00000020U) /*!< Bit mask for TSI_GENCS_STPE. */
#define BS_TSI_GENCS_STPE    (1U)          /*!< Bit field size in bits for TSI_GENCS_STPE. */

/*! @brief Read current value of the TSI_GENCS_STPE field. */
#define BR_TSI_GENCS_STPE(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_STPE, BS_TSI_GENCS_STPE))

/*! @brief Format value for bitfield TSI_GENCS_STPE. */
#define BF_TSI_GENCS_STPE(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_STPE) & BM_TSI_GENCS_STPE)

/*! @brief Set the STPE field to a new value. */
#define BW_TSI_GENCS_STPE(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_STPE), BP_TSI_GENCS_STPE, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIIEN[6] (RW)
 *
 * This bit enables TSI module interrupt request to CPU when the scan completes.
 * The interrupt will wake MCU from low power mode if this interrupt is enabled.
 *
 * Values:
 * - 0 - TSI interrupt is disabled.
 * - 1 - TSI interrupt is enabled.
 */
/*@{*/
#define BP_TSI_GENCS_TSIIEN  (6U)          /*!< Bit position for TSI_GENCS_TSIIEN. */
#define BM_TSI_GENCS_TSIIEN  (0x00000040U) /*!< Bit mask for TSI_GENCS_TSIIEN. */
#define BS_TSI_GENCS_TSIIEN  (1U)          /*!< Bit field size in bits for TSI_GENCS_TSIIEN. */

/*! @brief Read current value of the TSI_GENCS_TSIIEN field. */
#define BR_TSI_GENCS_TSIIEN(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIIEN, BS_TSI_GENCS_TSIIEN))

/*! @brief Format value for bitfield TSI_GENCS_TSIIEN. */
#define BF_TSI_GENCS_TSIIEN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_TSIIEN) & BM_TSI_GENCS_TSIIEN)

/*! @brief Set the TSIIEN field to a new value. */
#define BW_TSI_GENCS_TSIIEN(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_TSIIEN), BP_TSI_GENCS_TSIIEN, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIEN[7] (RW)
 *
 * This bit enables TSI module.
 *
 * Values:
 * - 0 - TSI module disabled.
 * - 1 - TSI module enabled.
 */
/*@{*/
#define BP_TSI_GENCS_TSIEN   (7U)          /*!< Bit position for TSI_GENCS_TSIEN. */
#define BM_TSI_GENCS_TSIEN   (0x00000080U) /*!< Bit mask for TSI_GENCS_TSIEN. */
#define BS_TSI_GENCS_TSIEN   (1U)          /*!< Bit field size in bits for TSI_GENCS_TSIEN. */

/*! @brief Read current value of the TSI_GENCS_TSIEN field. */
#define BR_TSI_GENCS_TSIEN(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIEN, BS_TSI_GENCS_TSIEN))

