NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*******************************************************************************
 * HW_UART0_C2 - UART Control Register 2
 ******************************************************************************/

/*!
 * @brief HW_UART0_C2 - UART Control Register 2 (RW)
 *
 * Reset value: 0x00U
 *
 * This register can be read or written at any time.
 */
typedef union _hw_uart0_c2
{
    uint8_t U;
    struct _hw_uart0_c2_bitfields
    {
        uint8_t SBK : 1;               /*!< [0] Send Break */
        uint8_t RWU : 1;               /*!< [1] Receiver Wakeup Control */
        uint8_t RE : 1;                /*!< [2] Receiver Enable */
        uint8_t TE : 1;                /*!< [3] Transmitter Enable */
        uint8_t ILIE : 1;              /*!< [4] Idle Line Interrupt Enable for IDLE */
        uint8_t RIE : 1;               /*!< [5] Receiver Interrupt Enable for RDRF */
        uint8_t TCIE : 1;              /*!< [6] Transmission Complete Interrupt Enable for
                                        * TC */
        uint8_t TIE : 1;               /*!< [7] Transmit Interrupt Enable for TDRE */
    } B;
} hw_uart0_c2_t;

/*!
 * @name Constants and macros for entire UART0_C2 register
 */
/*@{*/
#define HW_UART0_C2_ADDR(x)      ((uint32_t)(x) + 0x3U)

#define HW_UART0_C2(x)           (*(__IO hw_uart0_c2_t *) HW_UART0_C2_ADDR(x))
#define HW_UART0_C2_RD(x)        (HW_UART0_C2(x).U)
#define HW_UART0_C2_WR(x, v)     (HW_UART0_C2(x).U = (v))
#define HW_UART0_C2_SET(x, v)    (BME_OR8(HW_UART0_C2_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C2_CLR(x, v)    (BME_AND8(HW_UART0_C2_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C2_TOG(x, v)    (BME_XOR8(HW_UART0_C2_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C2 bitfields
 */

/*!
 * @name Register UART0_C2, field SBK[0] (RW)
 *
 * Writing a 1 and then a 0 to SBK queues a break character in the transmit data
 * stream. Additional break characters of 10 to 13, or 13 to 16 if BRK13 = 1,
 * bit times of logic 0 are queued as long as SBK is set. Depending on the timing
 * of the set and clear of SBK relative to the information currently being
 * transmitted, a second break character may be queued before software clears SBK.
 *
 * Values:
 * - 0 - Normal transmitter operation.
 * - 1 - Queue break character(s) to be sent.
 */
/*@{*/
#define BP_UART0_C2_SBK      (0U)          /*!< Bit position for UART0_C2_SBK. */
#define BM_UART0_C2_SBK      (0x01U)       /*!< Bit mask for UART0_C2_SBK. */
#define BS_UART0_C2_SBK      (1U)          /*!< Bit field size in bits for UART0_C2_SBK. */

/*! @brief Read current value of the UART0_C2_SBK field. */
#define BR_UART0_C2_SBK(x)   (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_SBK, BS_UART0_C2_SBK))

/*! @brief Format value for bitfield UART0_C2_SBK. */
#define BF_UART0_C2_SBK(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C2_SBK) & BM_UART0_C2_SBK)

/*! @brief Set the SBK field to a new value. */
#define BW_UART0_C2_SBK(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_SBK), BP_UART0_C2_SBK, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field RWU[1] (RW)
 *
 * This bit can be written to 1 to place the UART receiver in a standby state
 * where it waits for automatic hardware detection of a selected wakeup condition.
 * The wakeup condition is an idle line between messages, WAKE = 0, idle-line
 * wakeup, or a logic 1 in the most significant data bit in a character, WAKE = 1,
 * address-mark wakeup. Application software sets RWU and, normally, a selected
 * hardware condition automatically clears RWU.
 *
 * Values:
 * - 0 - Normal UART receiver operation.
 * - 1 - UART receiver in standby waiting for wakeup condition.
 */
/*@{*/
#define BP_UART0_C2_RWU      (1U)          /*!< Bit position for UART0_C2_RWU. */
#define BM_UART0_C2_RWU      (0x02U)       /*!< Bit mask for UART0_C2_RWU. */
#define BS_UART0_C2_RWU      (1U)          /*!< Bit field size in bits for UART0_C2_RWU. */

/*! @brief Read current value of the UART0_C2_RWU field. */
#define BR_UART0_C2_RWU(x)   (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_RWU, BS_UART0_C2_RWU))

/*! @brief Format value for bitfield UART0_C2_RWU. */
#define BF_UART0_C2_RWU(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C2_RWU) & BM_UART0_C2_RWU)

/*! @brief Set the RWU field to a new value. */
#define BW_UART0_C2_RWU(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_RWU), BP_UART0_C2_RWU, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field RE[2] (RW)
 *
 * When the UART receiver is off or LOOPS is set, the UART_RX pin is not used by
 * the UART . When RE is written to 0, the receiver finishes receiving the
 * current character (if any).
 *
 * Values:
 * - 0 - Receiver disabled.
 * - 1 - Receiver enabled.
 */
/*@{*/
#define BP_UART0_C2_RE       (2U)          /*!< Bit position for UART0_C2_RE. */
#define BM_UART0_C2_RE       (0x04U)       /*!< Bit mask for UART0_C2_RE. */
#define BS_UART0_C2_RE       (1U)          /*!< Bit field size in bits for UART0_C2_RE. */

/*! @brief Read current value of the UART0_C2_RE field. */
#define BR_UART0_C2_RE(x)    (BME_UBFX8(HW_UART0_C2_ADDR(x), BP_UART0_C2_RE, BS_UART0_C2_RE))

/*! @brief Format value for bitfield UART0_C2_RE. */
#define BF_UART0_C2_RE(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_C2_RE) & BM_UART0_C2_RE)

/*! @brief Set the RE field to a new value. */
#define BW_UART0_C2_RE(x, v) (BME_BFI8(HW_UART0_C2_ADDR(x), ((uint8_t)(v) << BP_UART0_C2_RE), BP_UART0_C2_RE, 1))
/*@}*/

/*!
 * @name Register UART0_C2, field TE[3] (RW)
 *
 * TE must be 1 to use the UART transmitter. When TE is set, the UART forces the
 * UART_TX pin to act as an output for the UART system. When the UART is
 * configured for single-wire operation (LOOPS = RSRC = 1), TXDIR controls the direction
 * of traffic on the single UART communication line ( UART_TX pin). TE can also
 * queue an idle character by clearing TE then setting TE while a transmission is
 * in progress. When TE is written to 0, the transmitter keeps control of the
 * port UART_TX pin until any data, queued idle, or queued break character finishes
 * transmitting before allowing the pin to tristate.
 *
 * Values:
 * - 0 - Transmitter disabled.
 * - 1 - Transmitter enabled.
 */
/*@{*/
#define BP_UART0_C2_TE       (3U)          /*!< Bit position for UART0_C2_TE. */
#define BM_UART0_C2_TE       (0x08U)       /*!< Bit mask for UART0_C2_TE. */
#define BS_UART0_C2_TE       (1U)          /*!< Bit field size in bits for UART0_C2_TE. */

