NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Format value for bitfield UART0_C3_TXDIR. */
#define BF_UART0_C3_TXDIR(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C3_TXDIR) & BM_UART0_C3_TXDIR)

/*! @brief Set the TXDIR field to a new value. */
#define BW_UART0_C3_TXDIR(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_TXDIR), BP_UART0_C3_TXDIR, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field R9T8[6] (RW)
 *
 * When the UART is configured for 9-bit data (M = 1), T8 may be thought of as a
 * ninth transmit data bit to the left of the msb of the data in the UART_D
 * register. When writing 9-bit data, the entire 9-bit value is transferred to the
 * UART transmit buffer after UART_D is written so T8 should be written, if it
 * needs to change from its previous value, before UART_D is written. If T8 does not
 * need to change in the new value, such as when it is used to generate mark or
 * space parity, it need not be written each time UART_D is written. When the UART
 * is configured for 10-bit data (M10 = 1), R9 can be thought of as a tenth
 * receive data bit. When reading 10-bit data, read R9 and R8 before reading UART_D
 * because reading UART_D completes automatic flag clearing sequences that could
 * allow R8, R9 and UART_D to be overwritten with new data.
 */
/*@{*/
#define BP_UART0_C3_R9T8     (6U)          /*!< Bit position for UART0_C3_R9T8. */
#define BM_UART0_C3_R9T8     (0x40U)       /*!< Bit mask for UART0_C3_R9T8. */
#define BS_UART0_C3_R9T8     (1U)          /*!< Bit field size in bits for UART0_C3_R9T8. */

/*! @brief Read current value of the UART0_C3_R9T8 field. */
#define BR_UART0_C3_R9T8(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_R9T8, BS_UART0_C3_R9T8))

/*! @brief Format value for bitfield UART0_C3_R9T8. */
#define BF_UART0_C3_R9T8(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_R9T8) & BM_UART0_C3_R9T8)

/*! @brief Set the R9T8 field to a new value. */
#define BW_UART0_C3_R9T8(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_R9T8), BP_UART0_C3_R9T8, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field R8T9[7] (RW)
 *
 * When the UART is configured for 9-bit data (M = 1), R8 can be thought of as a
 * ninth receive data bit to the left of the msb of the buffered data in the
 * UART_D register. When reading 9-bit data, read R8 before reading UART_D because
 * reading UART_D completes automatic flag clearing sequences that could allow R8
 * and UART_D to be overwritten with new data. When the UART is configured for
 * 10-bit data (M10 = 1), T9 may be thought of as a tenth transmit data bit. When
 * writing 10-bit data, the entire 10-bit value is transferred to the UART
 * transmit buffer when UART_D is written so T9 and T8 should be written, if it needs to
 * change from its previous value, before UART_D is written. If T9 and T8 do not
 * need to change in the new value, such as when it is used to generate mark or
 * space parity, they need not be written each time UART_D is written.
 */
/*@{*/
#define BP_UART0_C3_R8T9     (7U)          /*!< Bit position for UART0_C3_R8T9. */
#define BM_UART0_C3_R8T9     (0x80U)       /*!< Bit mask for UART0_C3_R8T9. */
#define BS_UART0_C3_R8T9     (1U)          /*!< Bit field size in bits for UART0_C3_R8T9. */

/*! @brief Read current value of the UART0_C3_R8T9 field. */
#define BR_UART0_C3_R8T9(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_R8T9, BS_UART0_C3_R8T9))

/*! @brief Format value for bitfield UART0_C3_R8T9. */
#define BF_UART0_C3_R8T9(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_R8T9) & BM_UART0_C3_R8T9)

/*! @brief Set the R8T9 field to a new value. */
#define BW_UART0_C3_R8T9(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_R8T9), BP_UART0_C3_R8T9, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_D - UART Data Register
 ******************************************************************************/

/*!
 * @brief HW_UART0_D - UART Data Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register is actually two separate registers. Reads return the contents
 * of the read-only receive data buffer and writes go to the write-only transmit
 * data buffer. Reads and writes of this register are also involved in the
 * automatic flag clearing mechanisms for some of the UART status flags.
 */
typedef union _hw_uart0_d
{
    uint8_t U;
    struct _hw_uart0_d_bitfields
    {
        uint8_t R0T0 : 1;              /*!< [0]  */
        uint8_t R1T1 : 1;              /*!< [1]  */
        uint8_t R2T2 : 1;              /*!< [2]  */
        uint8_t R3T3 : 1;              /*!< [3]  */
        uint8_t R4T4 : 1;              /*!< [4]  */
        uint8_t R5T5 : 1;              /*!< [5]  */
        uint8_t R6T6 : 1;              /*!< [6]  */
        uint8_t R7T7 : 1;              /*!< [7]  */
    } B;
} hw_uart0_d_t;

/*!
 * @name Constants and macros for entire UART0_D register
 */
/*@{*/
#define HW_UART0_D_ADDR(x)       ((uint32_t)(x) + 0x7U)

#define HW_UART0_D(x)            (*(__IO hw_uart0_d_t *) HW_UART0_D_ADDR(x))
#define HW_UART0_D_RD(x)         (HW_UART0_D(x).U)
#define HW_UART0_D_WR(x, v)      (HW_UART0_D(x).U = (v))
#define HW_UART0_D_SET(x, v)     (BME_OR8(HW_UART0_D_ADDR(x), (uint8_t)(v)))
#define HW_UART0_D_CLR(x, v)     (BME_AND8(HW_UART0_D_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_D_TOG(x, v)     (BME_XOR8(HW_UART0_D_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_D bitfields
 */

/*!
 * @name Register UART0_D, field R0T0[0] (RW)
 *
 * Read receive data buffer 0 or write transmit data buffer 0.
 */
/*@{*/
#define BP_UART0_D_R0T0      (0U)          /*!< Bit position for UART0_D_R0T0. */
#define BM_UART0_D_R0T0      (0x01U)       /*!< Bit mask for UART0_D_R0T0. */
#define BS_UART0_D_R0T0      (1U)          /*!< Bit field size in bits for UART0_D_R0T0. */

/*! @brief Read current value of the UART0_D_R0T0 field. */
#define BR_UART0_D_R0T0(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R0T0, BS_UART0_D_R0T0))

/*! @brief Format value for bitfield UART0_D_R0T0. */
#define BF_UART0_D_R0T0(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R0T0) & BM_UART0_D_R0T0)

