NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Set the R0T0 field to a new value. */
#define BW_UART0_D_R0T0(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R0T0), BP_UART0_D_R0T0, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R1T1[1] (RW)
 *
 * Read receive data buffer 1 or write transmit data buffer 1.
 */
/*@{*/
#define BP_UART0_D_R1T1      (1U)          /*!< Bit position for UART0_D_R1T1. */
#define BM_UART0_D_R1T1      (0x02U)       /*!< Bit mask for UART0_D_R1T1. */
#define BS_UART0_D_R1T1      (1U)          /*!< Bit field size in bits for UART0_D_R1T1. */

/*! @brief Read current value of the UART0_D_R1T1 field. */
#define BR_UART0_D_R1T1(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R1T1, BS_UART0_D_R1T1))

/*! @brief Format value for bitfield UART0_D_R1T1. */
#define BF_UART0_D_R1T1(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R1T1) & BM_UART0_D_R1T1)

/*! @brief Set the R1T1 field to a new value. */
#define BW_UART0_D_R1T1(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R1T1), BP_UART0_D_R1T1, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R2T2[2] (RW)
 *
 * Read receive data buffer 2 or write transmit data buffer 2.
 */
/*@{*/
#define BP_UART0_D_R2T2      (2U)          /*!< Bit position for UART0_D_R2T2. */
#define BM_UART0_D_R2T2      (0x04U)       /*!< Bit mask for UART0_D_R2T2. */
#define BS_UART0_D_R2T2      (1U)          /*!< Bit field size in bits for UART0_D_R2T2. */

/*! @brief Read current value of the UART0_D_R2T2 field. */
#define BR_UART0_D_R2T2(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R2T2, BS_UART0_D_R2T2))

/*! @brief Format value for bitfield UART0_D_R2T2. */
#define BF_UART0_D_R2T2(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R2T2) & BM_UART0_D_R2T2)

/*! @brief Set the R2T2 field to a new value. */
#define BW_UART0_D_R2T2(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R2T2), BP_UART0_D_R2T2, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R3T3[3] (RW)
 *
 * Read receive data buffer 3 or write transmit data buffer 3.
 */
/*@{*/
#define BP_UART0_D_R3T3      (3U)          /*!< Bit position for UART0_D_R3T3. */
#define BM_UART0_D_R3T3      (0x08U)       /*!< Bit mask for UART0_D_R3T3. */
#define BS_UART0_D_R3T3      (1U)          /*!< Bit field size in bits for UART0_D_R3T3. */

/*! @brief Read current value of the UART0_D_R3T3 field. */
#define BR_UART0_D_R3T3(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R3T3, BS_UART0_D_R3T3))

/*! @brief Format value for bitfield UART0_D_R3T3. */
#define BF_UART0_D_R3T3(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R3T3) & BM_UART0_D_R3T3)

/*! @brief Set the R3T3 field to a new value. */
#define BW_UART0_D_R3T3(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R3T3), BP_UART0_D_R3T3, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R4T4[4] (RW)
 *
 * Read receive data buffer 4 or write transmit data buffer 4.
 */
/*@{*/
#define BP_UART0_D_R4T4      (4U)          /*!< Bit position for UART0_D_R4T4. */
#define BM_UART0_D_R4T4      (0x10U)       /*!< Bit mask for UART0_D_R4T4. */
#define BS_UART0_D_R4T4      (1U)          /*!< Bit field size in bits for UART0_D_R4T4. */

/*! @brief Read current value of the UART0_D_R4T4 field. */
#define BR_UART0_D_R4T4(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R4T4, BS_UART0_D_R4T4))

/*! @brief Format value for bitfield UART0_D_R4T4. */
#define BF_UART0_D_R4T4(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R4T4) & BM_UART0_D_R4T4)

/*! @brief Set the R4T4 field to a new value. */
#define BW_UART0_D_R4T4(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R4T4), BP_UART0_D_R4T4, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R5T5[5] (RW)
 *
 * Read receive data buffer 5 or write transmit data buffer 5.
 */
/*@{*/
#define BP_UART0_D_R5T5      (5U)          /*!< Bit position for UART0_D_R5T5. */
#define BM_UART0_D_R5T5      (0x20U)       /*!< Bit mask for UART0_D_R5T5. */
#define BS_UART0_D_R5T5      (1U)          /*!< Bit field size in bits for UART0_D_R5T5. */

/*! @brief Read current value of the UART0_D_R5T5 field. */
#define BR_UART0_D_R5T5(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R5T5, BS_UART0_D_R5T5))

/*! @brief Format value for bitfield UART0_D_R5T5. */
#define BF_UART0_D_R5T5(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R5T5) & BM_UART0_D_R5T5)

/*! @brief Set the R5T5 field to a new value. */
#define BW_UART0_D_R5T5(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R5T5), BP_UART0_D_R5T5, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R6T6[6] (RW)
 *
 * Read receive data buffer 6 or write transmit data buffer 6.
 */
/*@{*/
#define BP_UART0_D_R6T6      (6U)          /*!< Bit position for UART0_D_R6T6. */
#define BM_UART0_D_R6T6      (0x40U)       /*!< Bit mask for UART0_D_R6T6. */
#define BS_UART0_D_R6T6      (1U)          /*!< Bit field size in bits for UART0_D_R6T6. */

/*! @brief Read current value of the UART0_D_R6T6 field. */
#define BR_UART0_D_R6T6(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R6T6, BS_UART0_D_R6T6))

/*! @brief Format value for bitfield UART0_D_R6T6. */
#define BF_UART0_D_R6T6(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R6T6) & BM_UART0_D_R6T6)

/*! @brief Set the R6T6 field to a new value. */
#define BW_UART0_D_R6T6(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R6T6), BP_UART0_D_R6T6, 1))
/*@}*/

/*!
 * @name Register UART0_D, field R7T7[7] (RW)
 *
 * Read receive data buffer 7 or write transmit data buffer 7.
 */
/*@{*/
#define BP_UART0_D_R7T7      (7U)          /*!< Bit position for UART0_D_R7T7. */
#define BM_UART0_D_R7T7      (0x80U)       /*!< Bit mask for UART0_D_R7T7. */
#define BS_UART0_D_R7T7      (1U)          /*!< Bit field size in bits for UART0_D_R7T7. */

/*! @brief Read current value of the UART0_D_R7T7 field. */
#define BR_UART0_D_R7T7(x)   (BME_UBFX8(HW_UART0_D_ADDR(x), BP_UART0_D_R7T7, BS_UART0_D_R7T7))

/*! @brief Format value for bitfield UART0_D_R7T7. */
#define BF_UART0_D_R7T7(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_D_R7T7) & BM_UART0_D_R7T7)

/*! @brief Set the R7T7 field to a new value. */
#define BW_UART0_D_R7T7(x, v) (BME_BFI8(HW_UART0_D_ADDR(x), ((uint8_t)(v) << BP_UART0_D_R7T7), BP_UART0_D_R7T7, 1))
/*@}*/

