NeoXiong/UVC/platform/CMSIS/Include/device/MKL26Z4/MKL26Z4_registers.h
/*! @brief Read current value of the UART0_C5_RESYNCDIS field. */
#define BR_UART0_C5_RESYNCDIS(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_RESYNCDIS, BS_UART0_C5_RESYNCDIS))

/*! @brief Format value for bitfield UART0_C5_RESYNCDIS. */
#define BF_UART0_C5_RESYNCDIS(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_RESYNCDIS) & BM_UART0_C5_RESYNCDIS)

/*! @brief Set the RESYNCDIS field to a new value. */
#define BW_UART0_C5_RESYNCDIS(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_RESYNCDIS), BP_UART0_C5_RESYNCDIS, 1))
/*@}*/

/*!
 * @name Register UART0_C5, field BOTHEDGE[1] (RW)
 *
 * Enables sampling of the received data on both edges of the baud rate clock,
 * effectively doubling the number of times the receiver samples the input data
 * for a given oversampling ratio. This bit must be set for oversampling ratios
 * between x4 and x7 and is optional for higher oversampling ratios. This bit should
 * only be changed when the receiver is disabled.
 *
 * Values:
 * - 0 - Receiver samples input data using the rising edge of the baud rate
 *     clock.
 * - 1 - Receiver samples input data using the rising and falling edge of the
 *     baud rate clock.
 */
/*@{*/
#define BP_UART0_C5_BOTHEDGE (1U)          /*!< Bit position for UART0_C5_BOTHEDGE. */
#define BM_UART0_C5_BOTHEDGE (0x02U)       /*!< Bit mask for UART0_C5_BOTHEDGE. */
#define BS_UART0_C5_BOTHEDGE (1U)          /*!< Bit field size in bits for UART0_C5_BOTHEDGE. */

/*! @brief Read current value of the UART0_C5_BOTHEDGE field. */
#define BR_UART0_C5_BOTHEDGE(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_BOTHEDGE, BS_UART0_C5_BOTHEDGE))

/*! @brief Format value for bitfield UART0_C5_BOTHEDGE. */
#define BF_UART0_C5_BOTHEDGE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_BOTHEDGE) & BM_UART0_C5_BOTHEDGE)

/*! @brief Set the BOTHEDGE field to a new value. */
#define BW_UART0_C5_BOTHEDGE(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_BOTHEDGE), BP_UART0_C5_BOTHEDGE, 1))
/*@}*/

/*!
 * @name Register UART0_C5, field RDMAE[5] (RW)
 *
 * RDMAE configures the receiver data register full flag, S1[RDRF], to generate
 * a DMA request.
 *
 * Values:
 * - 0 - DMA request disabled.
 * - 1 - DMA request enabled.
 */
/*@{*/
#define BP_UART0_C5_RDMAE    (5U)          /*!< Bit position for UART0_C5_RDMAE. */
#define BM_UART0_C5_RDMAE    (0x20U)       /*!< Bit mask for UART0_C5_RDMAE. */
#define BS_UART0_C5_RDMAE    (1U)          /*!< Bit field size in bits for UART0_C5_RDMAE. */

/*! @brief Read current value of the UART0_C5_RDMAE field. */
#define BR_UART0_C5_RDMAE(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_RDMAE, BS_UART0_C5_RDMAE))

/*! @brief Format value for bitfield UART0_C5_RDMAE. */
#define BF_UART0_C5_RDMAE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_RDMAE) & BM_UART0_C5_RDMAE)

/*! @brief Set the RDMAE field to a new value. */
#define BW_UART0_C5_RDMAE(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_RDMAE), BP_UART0_C5_RDMAE, 1))
/*@}*/

/*!
 * @name Register UART0_C5, field TDMAE[7] (RW)
 *
 * TDMAE configures the transmit data register empty flag, S1[TDRE], to generate
 * a DMA request.
 *
 * Values:
 * - 0 - DMA request disabled.
 * - 1 - DMA request enabled.
 */
/*@{*/
#define BP_UART0_C5_TDMAE    (7U)          /*!< Bit position for UART0_C5_TDMAE. */
#define BM_UART0_C5_TDMAE    (0x80U)       /*!< Bit mask for UART0_C5_TDMAE. */
#define BS_UART0_C5_TDMAE    (1U)          /*!< Bit field size in bits for UART0_C5_TDMAE. */

/*! @brief Read current value of the UART0_C5_TDMAE field. */
#define BR_UART0_C5_TDMAE(x) (BME_UBFX8(HW_UART0_C5_ADDR(x), BP_UART0_C5_TDMAE, BS_UART0_C5_TDMAE))

/*! @brief Format value for bitfield UART0_C5_TDMAE. */
#define BF_UART0_C5_TDMAE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C5_TDMAE) & BM_UART0_C5_TDMAE)

/*! @brief Set the TDMAE field to a new value. */
#define BW_UART0_C5_TDMAE(x, v) (BME_BFI8(HW_UART0_C5_ADDR(x), ((uint8_t)(v) << BP_UART0_C5_TDMAE), BP_UART0_C5_TDMAE, 1))
/*@}*/

/*******************************************************************************
 * hw_uart0_t - module struct
 ******************************************************************************/
/*!
 * @brief All UART0 module registers.
 */
#pragma pack(1)
typedef struct _hw_uart0
{
    __IO hw_uart0_bdh_t BDH;               /*!< [0x0] UART Baud Rate Register High */
    __IO hw_uart0_bdl_t BDL;               /*!< [0x1] UART Baud Rate Register Low */
    __IO hw_uart0_c1_t C1;                 /*!< [0x2] UART Control Register 1 */
    __IO hw_uart0_c2_t C2;                 /*!< [0x3] UART Control Register 2 */
    __IO hw_uart0_s1_t S1;                 /*!< [0x4] UART Status Register 1 */
    __IO hw_uart0_s2_t S2;                 /*!< [0x5] UART Status Register 2 */
    __IO hw_uart0_c3_t C3;                 /*!< [0x6] UART Control Register 3 */
    __IO hw_uart0_d_t D;                   /*!< [0x7] UART Data Register */
    __IO hw_uart0_ma1_t MA1;               /*!< [0x8] UART Match Address Registers 1 */
    __IO hw_uart0_ma2_t MA2;               /*!< [0x9] UART Match Address Registers 2 */
    __IO hw_uart0_c4_t C4;                 /*!< [0xA] UART Control Register 4 */
    __IO hw_uart0_c5_t C5;                 /*!< [0xB] UART Control Register 5 */
} hw_uart0_t;
#pragma pack()

/*! @brief Macro to access all UART0 registers. */
/*! @param x UART0 module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_UART0_REGS(UART0_BASE)</code>. */
#define HW_UART0_REGS(x) (*(hw_uart0_t *)(x))

/*
 * MKL26Z4 USB
 *
 * Universal Serial Bus, OTG Capable Controller
 *
 * Registers defined in this header file:
 * - HW_USB_PERID - Peripheral ID register
 * - HW_USB_IDCOMP - Peripheral ID Complement register
 * - HW_USB_REV - Peripheral Revision register
 * - HW_USB_ADDINFO - Peripheral Additional Info register
 * - HW_USB_OTGISTAT - OTG Interrupt Status register
 * - HW_USB_OTGICR - OTG Interrupt Control register
 * - HW_USB_OTGSTAT - OTG Status register
 * - HW_USB_OTGCTL - OTG Control register
 * - HW_USB_ISTAT - Interrupt Status register
 * - HW_USB_INTEN - Interrupt Enable register
 * - HW_USB_ERRSTAT - Error Interrupt Status register
 * - HW_USB_ERREN - Error Interrupt Enable register
 * - HW_USB_STAT - Status register
 * - HW_USB_CTL - Control register
 * - HW_USB_ADDR - Address register
 * - HW_USB_BDTPAGE1 - BDT Page register 1
 * - HW_USB_FRMNUML - Frame Number register Low
 * - HW_USB_FRMNUMH - Frame Number register High
 * - HW_USB_TOKEN - Token register
 * - HW_USB_SOFTHLD - SOF Threshold register
 * - HW_USB_BDTPAGE2 - BDT Page Register 2
 * - HW_USB_BDTPAGE3 - BDT Page Register 3
 * - HW_USB_ENDPTn - Endpoint Control register
 * - HW_USB_USBCTRL - USB Control register
 * - HW_USB_OBSERVE - USB OTG Observe register
 * - HW_USB_CONTROL - USB OTG Control register
 * - HW_USB_USBTRC0 - USB Transceiver Control register 0
 * - HW_USB_USBFRMADJUST - Frame Adjust Register
 *
 * - hw_usb_t - Struct containing all module registers.
 */

